BUILD=../build
النواه=النواه.elf

# =========================
# مسارات الهيدر
# =========================
INCLUDES = -I. -I.. -I../النظام

# =========================
# خيارات الترجمة
# =========================
CFLAGS = -m64 -mno-red-zone -mcmodel=large \
         -ffreestanding -fno-stack-protector -fno-pie -fno-pic \
         -Wall -Wextra -Wno-unused-function \
         $(INCLUDES)

LDFLAGS = -m elf_x86_64 -T ربط_الملفات.ld

all:
	mkdir -p $(BUILD)

	nasm -f elf64 القلب/محمل_تمهيد_النواه.asm \
	    -o $(BUILD)/محمل_تمهيد_النواه.o

	# ================= Core =================

	gcc $(CFLAGS) -c النواه.c \
		-o $(BUILD)/النواه.o

	gcc $(CFLAGS) -c القلب/الجوهرة.c \
		-o $(BUILD)/الجوهرة.o

	# ================= مكتبة_المحركات =================

	gcc $(CFLAGS) -c القلب/مكتبة_المحركات/مكتبة_معالجة_النصوص.c \
		-o $(BUILD)/مكتبة_معالجة_النصوص.o

	# ================= محرك_التطبيقات =================

	gcc $(CFLAGS) -c القلب/محركات_الخدمات/محرك_التطبيقات/محرك_التطبيقات.c \
        -o $(BUILD)/محرك_التطبيقات.o

	gcc $(CFLAGS) -c القلب/محركات_الخدمات/محرك_التطبيقات/الصيغه/تطبيق.c \
        -o $(BUILD)/تطبيق.o
	gcc $(CFLAGS) -c القلب/محركات_الخدمات/محرك_التطبيقات/الصيغه/هيكل_التطبيق/رأس_التطبيق.c \
        -o $(BUILD)/رأس_التطبيق.o
	gcc $(CFLAGS) -c القلب/محركات_الخدمات/محرك_التطبيقات/الصيغه/هيكل_التطبيق/بيانات_التطبيق.c \
        -o $(BUILD)/بيانات_التطبيق.o
	gcc $(CFLAGS) -c القلب/محركات_الخدمات/محرك_التطبيقات/الصيغه/هيكل_التطبيق/أمتداد_التطبيق.c \
        -o $(BUILD)/أمتداد_التطبيق.o



	# ================= أختبار =================

	gcc $(CFLAGS) -c القلب/محركات_الخدمات/اختبار/مؤشر_الفأرة/مؤشر_الفأرة.c \
		-o $(BUILD)/مؤشر_الفأرة.o

	gcc $(CFLAGS) -c القلب/محركات_الخدمات/اختبار/لوحة_المفاتيح/لوحة_المفاتيح.c \
		-o $(BUILD)/لوحة_المفاتيح.o

	# ================= محرك_الذاكرة =================

	gcc $(CFLAGS) -c محرك_الذاكرة/بوابة_الذاكرة.c \
		-o $(BUILD)/بوابة_الذاكرة.o

	gcc $(CFLAGS) -c محرك_الذاكرة/محرك_الذاكرة.c \
		-o $(BUILD)/محرك_الذاكرة.o

	gcc $(CFLAGS) -c محرك_الذاكرة/مدير_الكومة/مدير_الكومة.c \
		-o $(BUILD)/مدير_الكومة.o

	gcc $(CFLAGS) -c محرك_الذاكرة/مدير_الصفحات/مدير_الصفحات.c \
		-o $(BUILD)/مدير_الصفحات.o

	# ================= محرك_العمليات =================

	gcc $(CFLAGS) -c محرك_العمليات/بوابة_العمليات.c \
		-o $(BUILD)/بوابة_العمليات.o

	gcc $(CFLAGS) -c محرك_العمليات/محرك_العمليات.c \
		-o $(BUILD)/محرك_العمليات.o

	gcc $(CFLAGS) -c محرك_العمليات/مدير_عمليات_النواه/مدير_عمليات_النواه.c \
		-o $(BUILD)/مدير_عمليات_النواه.o

	# ================= محرك_تواصل_العمليات =================

	gcc $(CFLAGS) -c محرك_تواصل_العمليات/بوابة_النواه.c \
		-o $(BUILD)/بوابة_النواه.o

	gcc $(CFLAGS) -c محرك_تواصل_العمليات/محرك_تواصل_العمليات.c \
		-o $(BUILD)/محرك_ربط_العمليات.o



	# ================= محرك_الجدولة =================

	gcc $(CFLAGS) -c محرك_الجدولة/بوابة_الجدولة.c \
		-o $(BUILD)/بوابة_الجدولة.o

	gcc $(CFLAGS) -c محرك_الجدولة/محرك_الجدولة.c \
		-o $(BUILD)/محرك_الجدولة.o

	gcc $(CFLAGS) -c محرك_الجدولة/مُدير_راحة_العمليات/مُدير_راحة_العمليات.c \
		-o $(BUILD)/مُدير_راحة_العمليات.o

	gcc $(CFLAGS) -c محرك_الجدولة/مُدير_الأحداث/مُدير_الأحداث.c \
		-o $(BUILD)/مُدير_الأحداث.o

	gcc $(CFLAGS) -c محرك_الجدولة/مُدير_قائمة_الأنتظار/مُدير_قائمة_الأنتظار.c \
		-o $(BUILD)/مُدير_قائمة_الأنتظار.o

	# ================= محرك_المقاطعات =================#1

	gcc $(CFLAGS) -c محرك_المقاطعات/بوابة_المقاطعات.c \
		-o $(BUILD)/بوابة_المقاطعات.o

	gcc $(CFLAGS) -c محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُدير_جدول_المقاطعات.c \
		-o $(BUILD)/مُدير_جدول_المقاطعات.o

	gcc $(CFLAGS) -c محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُعالج_IRQ.c \
		-o $(BUILD)/مُعالج_IRQ.o



	nasm -f elf64 \
		محرك_المقاطعات/أدارة_تنظيم_المقاطعات/معالج_خدمات_المقاطعات.asm \
		-o $(BUILD)/معالج_خدمات_المقاطعات.o

	nasm -f elf64 \
		محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُحمل_جدول_واصفات_المقاطعات.asm \
		-o $(BUILD)/مُحمل_جدول_واصفات_المقاطعات.o

	nasm -f elf64 \
		محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُبدل_الحالة.asm \
		-o $(BUILD)/مُبدل_الحالة.o
    #==================#2
	gcc $(CFLAGS) -c محرك_المقاطعات/الأداره_المتقدمة_للمقاطعات/مُتحكم_المقاطعات.c \
		-o $(BUILD)/مُتحكم_المقاطعات.o

	gcc $(CFLAGS) -c محرك_المقاطعات/الأداره_المتقدمة_للمقاطعات/مُتحكم_وموجه_المقاطعات.c \
		-o $(BUILD)/مُتحكم_وموجه_المقاطعات.o
	gcc $(CFLAGS) -c محرك_المقاطعات/الأداره_المتقدمة_للمقاطعات/مؤقت_تنظيم_المقاطعات/المؤقت.c \
		-o $(BUILD)/المؤقت.o



	# ================= محرك_الفيديو =================

	gcc $(CFLAGS) -c القلب/محركات_الخدمات/محرك_الفيديو/بوابة_الفيديو.c \
	    -o $(BUILD)/بوابة_الفيديو.o

	gcc $(CFLAGS) -c القلب/محركات_الخدمات/محرك_الفيديو/محرك_الفيديو.c \
	    -o $(BUILD)/محرك_الفيديو.o



	# ================= الربط =================

	ld $(LDFLAGS) -o ../$(النواه) $(BUILD)/*.o

	@if [ -d ../boot ]; then \
		echo "نقل $(النواه) إلى ../boot"; \
		mv -f ../$(النواه) ../boot/$(النواه); \
	else \
		echo "المجلد ../boot غير موجود"; \
	fi


clean:
	rm -rf $(BUILD)
	rm -f ../$(النواه)
	rm -f ../boot/$(النواه)

.PHONY: all clean
