#include "المؤقت.h"
#include "محرك_الجدولة/محرك_الجدولة.h"
#include "محرك_الجدولة/الأدارة/مُدير_الأحداث.h"
#include "محرك_المقاطعات/الأداره_المتقدمة_للمقاطعات/مُتحكم_المقاطعات.h"

/*

المؤقت ، وهو جزء مهم من اجزاء المقاطعات لادارة الوقت ويعمل كعداد لنبضات منذ بدء تشغيل النظام.
اي يقوم بالعمل بعد بدء تشغيل النظام ولاحسب الوقت الا بعد تشغيلة وليس مؤقت حقيقي للوقت في الوقت الحالي،
انما يُستخدم لاغراض تسجيل الوقت.
*/


volatile uint64_t ticks = 0;

void timer_init(){
        /*دالة تهيئة المؤقت*/
    lapic_timer_init();
}


uint64_t timer_get_ticks(){
                           /*دالة بسيطة تسمح للأجزاء الأخرى من النظام بمعرفة كم عدد النبضات (الوقت) التي مرت منذ تشغيل الجهاز.*/
    return ticks;
}


void timer_handler(){

        /*
                            معالج المقاطعة timer_handler (مُعالج المؤقت)

                            هذه الدالة هي الأهم، وتُستدعى تلقائياً في كل مرة يرسل فيها المؤقت نبضة (Hardware Interrupt):*/

    ticks++;

    scheduler_tick();

    events |= EVENT_SCHEDULE;
}
