#include "اختبار_اول.h"
#include "محرك_الذاكرة/بوابة_الذاكرة.h"

/*

الاختبار مصمم للتحق من ان محرك شاشة الخطاء الخاصة يعمل بشكل جيد وملاحق للمشاكل الصامتة مع اظهار تفاصيل المشكلة.

كيفية الاختبار:

       فعّل اختبار واحد بس في كل مرة (شيل التعليق عن السطر المطلوب)


*/


void test_erorr_main(){






    /* اختبار ١: page fault حقيقي (كتابة على عنوان غير معيّن) */


    /*
    {
        volatile uint64_t* test_bad_ptr = (uint64_t*)0xDEAD00000000UL;
        *test_bad_ptr = 0x1234;
    }

    */



    /* اختبار ٢: قسمة على صفر (#DE) — شيل التعليقه وعلق باقي الاختبارات لانة لايمكن  ان يعمل الاختبار طالما يوجد اختبار مفعل قبلة*/

    /*
    {
        volatile int a = 10;
        volatile int b = 0;
        volatile int c = a / b;
        (void)c;
    }
    */


        /* اختبار ٣: opcode غير صالح (#UD) — شيل التعليق*/

    /*asm volatile("ud2");*/



}
